<?php

return [
    'city'                          => 'مدينة',
    'cities'                        => 'المدن',
    'all_cities'                    => 'جميع المدن',
    'city_content'                  => 'محتوي المدينة',
    'content'                       => 'المحتوي',
    'create'                        => 'إنشاء مدينة',
    'edit'                          => 'تعديل',
    'cityNames'                     => 'أسماء المدن',
    'addCity'                       => 'إضافة مدينه جديده',
    'showCities'                    => 'عرض المدن ',
    'name'                          => 'الاسم',
    'add_new'                       => 'إضافة',
    'update'                        => 'تعديل',
    'deleted_cities'                => 'المدن المحذوفه',
    'Show_deleted_cities'           => 'جميع المدن المحذوفه',
    'cityDescription'               => '.جميع المدن ان كنت ترغب في إنشاء و إضافة مدن جديده ف عليك بالضغط علي زر (إضافة مدينة جديده) في أعلي الصفحة',
];
