<?php

return [
    'country'                           => 'دولة',
    'countries'                         => 'الدول',
    'all_countries'                     => 'جميع الدول',
    'create'                            => 'إنشاء دولة',
    'edit'                              => 'تعديل الدولة',
    'NameCountry'                       => 'أسماء الدول',
    'addCountry'                        => 'إضافة دولة جديده',
    'showCountry'                       => 'عرض الدول',
    'deleted_countries'                 => 'الدول المحذوفة',
    'Show_deleted_countries'            => 'عرض الدول المحذوفة',
    'name'                              => 'الاسم',
    'add_new'                           => 'إضافة',
    'update'                            => 'تعديل',
    'DescriptionCountry'                => '.جميع الدول ان كنت ترغب في إنشاء إضافة دولة جديده ف عليك بالضغط علي زر (إضافة دولة جديده) في أعلي الصفحة',
    'DescriptionCountry_delete'         => '.جميع الدول المحذوفة إذا كنت ترغب في إنشاء وإضافة دولة جديدة، يجب النقر فوق الزر (إضافة دولة جديدة) في أعلي الصفحة، واذا كنت تريد استعادة اى دولة اضغط على (استرجاع) بجانبك كل دولة',
];
