<?php

return [
    'event'                       => 'حدث',
    'events'                      => 'الأحداث',
    'all_events'                  => 'جميع الأحداث',
    'create'                      => 'إنشاء حدث',
    'edit'                        => 'تعديل',
    'TitleEvent'                  => 'عنوان الحدث',
    'addEvent'                    => 'إضافة حدث جديد',
    'showEvent'                   => 'عرض الأحداث',
    'name'                        => 'الاسم',
    'add_new'                     => 'إضافة',
    'update'                      => 'تعديل',
    'time'                        => 'الوقت',
    'budget'                      => 'الميزانية',
    'location'                    => 'الموقع',
    'deleted_events'              => 'الأحداث المحذوفة',
    'invitation_address'          => 'عنوان الدعوة',
    'date'                        => 'التاريخ',
    'enter_budget'                => 'أدخل الميزانية',
    'DescriptionEvent'            => '.جميع الأحداث ان كنت ترغب في إنشاء و إضافة أحداث جديده ف عليك بالضغط علي زر (إضافة حدث جديده) في أعلي الصفحة',
];
