<?php

return [
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message name
    ///////////////////////////////////////////////////////////////////////////////////////
    'name_required'                   => 'حقل الاسم مطلوب.',
    'name_min'                        => 'يجب أن يكون طول نص حقل الاسم على الأقل 3 حروفٍ/حرفًا!',
    'name_max'                        => 'يجب أن لا يتجاوز طول نّص حقل الاسم 199 حروفٍ/حرفًا!',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message username
    ///////////////////////////////////////////////////////////////////////////////////////
    'username_required'               => 'حقل اسم المستخدم مطلوب.',
    'username_min'                    => 'يجب أن يكون طول نص حقل اسم المستخدم على الأقل 3 حروفٍ/حرفًا!',
    'username_max'                    => 'يجب أن لا يتجاوز طول نّص حقل اسم المستخدم 199 حروفٍ/حرفًا!',
    'username_unique'                 => 'قيمة اسم المستخدم قيد الاستخدام بالفعل.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message phone
    ///////////////////////////////////////////////////////////////////////////////////////
    'phone_required'                  => 'حقل الهاتف مطلوب.',
    'phone_numeric'                   => 'يجب أن يكون الهاتف رقمًا.',
    'phone_digits'                    => 'يجب أن يتكون الهاتف من 11 رقمًا.',
    'phone_unique'                    => 'قيمة الهاتف قيد الاستخدام بالفعل.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message message
    ///////////////////////////////////////////////////////////////////////////////////////
    'message_required'                => 'حقل الرسالة مطلوب.',
    'message_max'                     => 'يجب ألا يتجاوز طول نص حقل الرسالة 500 حرف / حرف.',
    'message_min'                     => 'يجب ألا يقل طول نص حقل الرسالة عن 3 أحرف / حرف.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message subject
    ///////////////////////////////////////////////////////////////////////////////////////
    'subject_required'                => 'حقل الموضوع مطلوب.',
    'subject_max'                     => 'يجب ألا يتجاوز طول نص حقل الموضوع 199 حرفًا / حرفًا.',
    'subject_min'                     => 'يجب ألا يقل طول نص حقل الموضوع عن 3 أحرف / حرف.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message whatsApp
    ///////////////////////////////////////////////////////////////////////////////////////
    'whatsApp_required'               => 'حقل الواتساب مطلوب.',
    'whatsApp_numeric'                => 'يجب أن يكون الواتساب رقمًا.',
    'whatsApp_digits'                 => 'يجب أن يتكون الواتساب من 14 رقمًا.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message email
    ///////////////////////////////////////////////////////////////////////////////////////
    'email_required'                  => 'حقل البريد الإلكتروني مطلوب.',
    'email_min'                       => 'يجب أن يكون طول نص حقل البريد الإلكتروني على الأقل 3 حروفٍ/حرفًا!',
    'email_max'                       => 'يجب أن لا يتجاوز طول نّص حقل البريد الإلكتروني 199 حروفٍ/حرفًا!',
    'email_unique'                    => 'قيمة البريد الإلكتروني قيد الاستخدام بالفعل.',
    'email_email'                     => 'يجب أن يكون حقل البريد الإلكتروني عنوان بريد إلكتروني صحيح البُنية.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message bio
    ///////////////////////////////////////////////////////////////////////////////////////
    'bio_max'                         => 'يجب أن لا يتجاوز طول نّص حقل ْعَنِّي 255 حروفٍ/حرفًا!',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message gender
    ///////////////////////////////////////////////////////////////////////////////////////
    'gender_in'                       => 'الجنس المحدد غير صالح.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message gender
    ///////////////////////////////////////////////////////////////////////////////////////
    'dob_date'                        => 'تاريخ الميلاد ليس تاريخا صحيحا.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message address
    ///////////////////////////////////////////////////////////////////////////////////////
    'address_max'                     => 'يجب أن لا يتجاوز طول نّص حقل العنوان 255 حروفٍ/حرفًا!',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message postal code
    ///////////////////////////////////////////////////////////////////////////////////////
    'postal_code_numeric'             => 'يجب أن يكون الرمز البريدي رقمًا.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message name ar
    ///////////////////////////////////////////////////////////////////////////////////////
    'name_ar_required'                => 'حقل الاسم بالعربي مطلوب.',
    'name_ar_min'                     => 'يجب أن يكون طول نص حقل الاسم بالعربي على الأقل 3 حروفٍ/حرفًا!',
    'name_ar_max'                     => 'يجب أن لا يتجاوز طول نّص حقل الاسم بالعربي 199 حروفٍ/حرفًا!',

    'name_en_required'                => 'حقل الاسم بالانجليزي مطلوب.',
    'name_en_min'                     => 'يجب أن يكون طول نص حقل الاسم بالانجليزي على الأقل 3 حروفٍ/حرفًا!',
    'name_en_max'                     => 'يجب أن لا يتجاوز طول نّص حقل الاسم بالانجليزي 199 حروفٍ/حرفًا!',

    'name_fr_required'                => 'حقل الاسم بالفرنساوي مطلوب.',
    'name_fr_min'                     => 'يجب أن يكون طول نص حقل الاسم بالفرنساوي على الأقل 3 حروفٍ/حرفًا!',
    'name_fr_max'                     => 'يجب أن لا يتجاوز طول نّص حقل الاسم بالفرنساوي 199 حروفٍ/حرفًا!',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message content
    ///////////////////////////////////////////////////////////////////////////////////////
    'content_ar_required'             => 'حقل المحتوي بالعربي مطلوب.',
    'content_ar_max'                  => 'يجب أن لا يتجاوز طول نّص حقل المحتوي بالعربي 500 حروفٍ/حرفًا!',

    'content_en_required'             => 'حقل المحتوي بالانجليزي مطلوب.',
    'content_en_max'                  => 'يجب أن لا يتجاوز طول نّص حقل المحتوي بالانجليزي 500 حروفٍ/حرفًا!',

    'content_fr_required'             => 'حقل المحتوي بالفرنساوي مطلوب.',
    'content_fr_max'                  => 'يجب أن لا يتجاوز طول نّص حقل المحتوي بالفرنساوي 500 حروفٍ/حرفًا!',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message description
    ///////////////////////////////////////////////////////////////////////////////////////
    'description_ar_required'         => 'حقل الوصف بالعربي مطلوب.',
    'description_ar_max'              => 'يجب أن لا يتجاوز طول نّص حقل الوصف بالعربي 500 حروفٍ/حرفًا!',

    'description_en_required'         => 'حقل الوصف بالانجليزي مطلوب.',
    'description_en_max'              => 'يجب أن لا يتجاوز طول نّص حقل الوصف بالانجليزي 500 حروفٍ/حرفًا!',

    'description_fr_required'         => 'حقل الوصف بالفرنساوي مطلوب.',
    'description_fr_max'              => 'يجب أن لا يتجاوز طول نّص حقل الوصف بالفرنساوي 500 حروفٍ/حرفًا!',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message title
    ///////////////////////////////////////////////////////////////////////////////////////
    'title_ar_required'               => 'حقل العنوان بالعربي مطلوب.',
    'title_ar_min'                    => 'يجب أن يكون طول نص حقل العنوان بالعربي على الأقل 3 حروفٍ/حرفًا!',
    'title_ar_max'                    => 'يجب أن لا يتجاوز طول نّص حقل العنوان بالعربي 199 حروفٍ/حرفًا!',

    'title_en_required'               => 'حقل العنوان بالانجليزي مطلوب.',
    'title_en_min'                    => 'يجب أن يكون طول نص حقل العنوان بالانجليزي على الأقل 3 حروفٍ/حرفًا!',
    'title_en_max'                    => 'يجب أن لا يتجاوز طول نّص حقل العنوان بالانجليزي 199 حروفٍ/حرفًا!',

    'title_fr_required'               => 'حقل العنوان بالفرنساوي مطلوب.',
    'title_fr_min'                    => 'يجب أن يكون طول نص حقل العنوان بالفرنساوي على الأقل 3 حروفٍ/حرفًا!',
    'title_fr_max'                    => 'يجب أن لا يتجاوز طول نّص حقل العنوان بالفرنساوي 199 حروفٍ/حرفًا!',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message location
    ///////////////////////////////////////////////////////////////////////////////////////
    'location_ar_required'            => 'حقل الموقع بالعربي مطلوب.',
    'location_ar_max'                 => 'يجب أن لا يتجاوز طول نّص حقل الموقع بالعربي 199 حروفٍ/حرفًا!',

    'location_en_required'            => 'حقل الموقع بالانجليزي مطلوب.',
    'location_en_max'                 => 'يجب أن لا يتجاوز طول نّص حقل الموقع بالانجليزي 199 حروفٍ/حرفًا!',

    'location_fr_required'            => 'حقل الموقع بالفرنساوي مطلوب.',
    'location_fr_max'                 => 'يجب أن لا يتجاوز طول نّص حقل الموقع بالفرنساوي 199 حروفٍ/حرفًا!',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message time
    ///////////////////////////////////////////////////////////////////////////////////////
    'time_required'                   => 'حقل الوقت مطلوب.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message Date
    ///////////////////////////////////////////////////////////////////////////////////////
    'date_required'                   => 'حقل التاريخ مطلوب.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message country id
    ///////////////////////////////////////////////////////////////////////////////////////
    'country_id_required'             => 'حقل الدولة مطلوب.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message governorate id
    ///////////////////////////////////////////////////////////////////////////////////////
    'governorate_id_required'         => 'حقل المحافظة مطلوب.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message city id
    ///////////////////////////////////////////////////////////////////////////////////////
    'city_id_required'                => 'حقل المدينة مطلوب.',
    'city_exists'                     => 'المدينة المختارة غير صالحة.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message user id
    ///////////////////////////////////////////////////////////////////////////////////////
    'user_id_required'                => 'حقل المستخدم مطلوب.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message category id
    ///////////////////////////////////////////////////////////////////////////////////////
    'category_id_required'            => 'حقل القسم مطلوب.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message budget
    ///////////////////////////////////////////////////////////////////////////////////////
    'budget_required'                 => 'حقل الميزانية مطلوب.',
    'budget_integer'                  => 'يجب أن يكون حقل الميزانية عددًا صحيحًا.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message status
    ///////////////////////////////////////////////////////////////////////////////////////
    'status_required'                 => '.حقل الحالة مطلوب.',
    'status_selected'                 => 'الحالة المختارة غير صالحة.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message country id
    ///////////////////////////////////////////////////////////////////////////////////////
    'country_id'                      => 'اختر دول من الدول، الدول مطلوبه.',
    'country_exists'                  => 'الدولة المختارة غير صالحة.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message category id
    ///////////////////////////////////////////////////////////////////////////////////////
    'category_id'                      => 'اختر قسم من الأقسام، الأقسام مطلوبه.',
    'category_exists'                  => 'الأقسام المختارة غير صالحة.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message country id
    ///////////////////////////////////////////////////////////////////////////////////////
    'governorate_id'                  => 'اختر محافظه من المحافظات، المحافظة مطلوبه.',
    'governorate_exists'              => 'المحافظة المختارة غير صالحة.',
    ///////////////////////////////////////////////////////////////////////////////////////
    /// Check the message Users
    ///////////////////////////////////////////////////////////////////////////////////////
    'current_password_required'     => 'كلمة المرور الحالية مطلوبة.',
    'current_password_min'          => 'يجب أن تكون كلمة المرور الحالية أكثر من 8 أحرف.',
    'current_password'              => 'يجب أن تكون كلمة المرور الحالية صحيحة.',
    'password_required'             => ' كلمة مرور جديدة مطلوبه.',
    'password_confirmed'            => 'يجب أن تتطابق كلمة المرور.',
    'password_min'                  => 'يجب أن تكون كلمة المرور أكثر من 8 أحرف.',
    'avatar_image'                  => 'يجب ان تكون الصورة من فئة (jpg, jpeg, png, bmp, gif, svg,webp).',
    'cover_image'                   => 'يجب ان تكون الصورة من فئة (jpg, jpeg, png, bmp, gif, svg,webp).',
];
